[
    {
        "name": "Karaage (Japanese Fried Chicken)",
        "summary": "The only karaage recipe you'll ever need. Learn two methods of frying that produce moist, flavorful, boneless, skinless Japanese fried chicken with a super-thin coating that's incredibly crispy and crunchy. Serve with lemon or lime wedges.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Mix garlic, ginger, soy sauce, sake, mirin, sesame oil, black pepper, cayenne, sugar, and salt in a medium bowl. | Place chicken in the marinade and mix until thoroughly and evenly coated. Cover and refrigerate for 1 to 10 hours. | Set up your dredging station: Place a wire rack over a foil-lined baking sheet. Add potato starch to a wide, shallow bowl. | Remove chicken from the refrigerator. Stir to coat with marinade. Toss 2 or 3 pieces at a time in the potato starch until evenly coated. Shake off any excess starch and place chicken on the wire rack. Repeat to dredge remaining pieces. | Tap the rack on the baking sheet to remove any loose chunks of starch, then transfer the baking sheet and rack of chicken to the refrigerator for 15 to 30 minutes. | Heat oil in a deep fryer to 350 degrees F (175 degrees C). | Without crowding, lower chicken carefully into the hot oil in batches. Fry, tossing occasionally, until cooked through and the outside is crunchy and browned, 3 to 4 minutes. Transfer to a paper towel-lined plate to drain. Repeat with remaining chicken.\n\n \n\n\n\n\n\n \n Karaage Japanese Fried Chicken.\nChef John",
        "ingredients": "1 clove garlic, finely grated | 1 tablespoon finely grated fresh ginger | 3 tablespoons soy sauce | 3 tablespoons sake | 1 tablespoon mirin | ⅛ teaspoon sesame oil | ¼ teaspoon ground black pepper | 1 pinch cayenne pepper | ½ teaspoon white sugar | ¼ teaspoon kosher salt | 1 ¼ pounds boneless, skinless chicken thighs, cut into 2-inch pieces | 1 cup potato starch | 1 quart canola oil, or as needed",
        "url": "https://www.allrecipes.com/recipe/8325387/karaage-japanese-fried-chicken/"
    },
    {
        "name": "Yaki Udon",
        "summary": "Yaki Udon is a classic Japanese stir-fry dish with udon noodles and lots of vegetables in a soy-based sauce. Feel free to add meat or tofu.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Whisk together oyster sauce, soy sauce, mirin, rice vinegar, Worcestershire, sesame oil, sugar, Sriracha, and garlic in a small bowl; set aside. Remove root ends from scallions and discard. Chop whites and light greens into 2-inch pieces and quarter pieces lengthwise; set aside. Thinly slice remaining dark greens of scallions and reserve for garnish. | Heat oil in a large skillet or wok over medium-high heat. Add mushrooms in a single layer and cook, undisturbed, until browned on first side, about 3 minutes. Stir and continue to cook, stirring occasionally, until mushrooms are tender and golden brown on both sides, about 4 more minutes. Add bok choy, carrots, sliced whites and light greens of scallions, and 1/4 cup water to pan with mushrooms. Cook, stirring occasionally, until vegetables are just tender, about 3 minutes. | Add udon noodles and remaining 1/4 cup water and cook, gently separating noodles with tongs or spoon. Add reserved oyster sauce mixture and cook, stirring constantly, until noodles and vegetables are well-coated, about 1 minute. Divide among serving bowls and garnish with reserved sliced greens of scallions and optional garnishes. Serve immediately.",
        "ingredients": "¼ cup oyster sauce | 3 tablespoons soy sauce | 2 tablespoons mirin | 1 tablespoon unseasoned rice vinegar | 2 teaspoons Worcestershire sauce | 2 teaspoons toasted sesame oil | 1 teaspoon packed light brown sugar | 1 teaspoon Sriracha sauce | 1 medium garlic, grated | 1 medium (5-oz.) bunch scallions | 2 tablespoons canola oil | 12 ounces sliced mixed wild mushrooms (such as cremini, oyster, and shiitake) (about 6 cups) | 2 medium heads baby bok choy, thinly sliced | 1 (10 ounce) package carrots, cut into match-stick size pieces | ½ cup water, divided | 1 (14 ounce) package pre-cooked udon noodles (such as KA-ME) | Optional garnishes: thinly sliced nori, cilantro, lime wedges, furikake seasoning",
        "url": "https://www.allrecipes.com/recipe/8539106/yaki-udon/"
    },
    {
        "name": "Okinawa Shoyu Pork",
        "summary": "I think the Okinawans got the slow food concept right. Okinawa shoyu pork was one of my favorite recipes growing up. Shoyu pork is eaten over rice or on top of soba noodles. The soy sauce-marinated, slow-cooked pork has just the right amount of sweet taste (imagine Okinawan brown sugar). It is pretty close to perfect.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Place pork belly into a large pot; cover with water by about 1-inch. Bring to a boil over medium-high heat; simmer for 2 minutes. Discard water; fill pot with fresh water to cover pork by about 1-inch. Bring to a boil over medium-high heat, then reduce heat to a simmer. Cook until pork begins to soften, about 1 hour. | Transfer pork to a cutting board and cool for 3 to 5 minutes; slice off and discard thick skin. Cut remaining pork meat into 1-inch wide slices. Set aside. | Combine soy sauce, brown sugar, 1/2 cup water, mirin, ginger, and garlic in a large saucepan; bring to a boil over high heat. Add sliced pork belly; bring to a boil, then reduce heat to low. Place a sheet of aluminum foil directly over meat and sauce; simmer uncovered until pork is tender, 30 to 45 minutes, turning the pork several times to cook evenly.",
        "ingredients": "1 ½ pounds whole pork belly | ½ cup soy sauce | ½ cup packed brown sugar | ½ cup water | ½ cup mirin (Japanese sweet wine) | 2 teaspoons ground ginger | 1 clove garlic, or to taste, minced",
        "url": "https://www.allrecipes.com/recipe/216760/okinawa-shoyu-pork/"
    },
    {
        "name": "Tonkatsu",
        "summary": "These breaded and fried pork cutlets make a traditional Japanese dish, tonkatsu, that is very simple and easy to make. Serve with sticky rice and tonkatsu sauce and enjoy! Also great if substituted with chicken breasts.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Place pork chops between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound pork with the smooth side of a meat mallet to a 1/4-inch thickness (about .75 cm). Season with salt and black pepper. | Pour oil into a skillet until 1/2 inch (1.25 cm) deep; heat over medium-high heat to 375 degrees F (190 degrees C). | Place flour, egg, and panko bread crumbs into 3 separate bowls. Dredge pork cutlets in flour; shake off excess. Dip into beaten egg. Lift up so excess egg drips back into the bowl. Press into bread crumbs to coat both sides; tap off any loose crumbs. Place breaded cutlets, unstacked, onto a plate. | Lower cutlets carefully into the hot oil. Fry until golden brown and cooked through, about 4 minutes per side. Transfer to a paper-towel-lined plated to drain.",
        "ingredients": "4 (4 ounce) boneless pork chops | salt and ground black pepper to taste | 2 cups oil for frying, or as needed | ¼ cup all-purpose flour | 1  egg, beaten | ¾ cup panko (Japanese-style) bread crumbs",
        "url": "https://www.allrecipes.com/recipe/46543/tonkatsu/"
    },
    {
        "name": "Authentic Yakisoba",
        "summary": "This authentic yakisoba was taught to me by my host mother when I lived in Osaka, Japan. It is the real deal and my friends love it.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Bring a large pot of water to a boil. Cook soba in boiling water, stirring occasionally, until noodles are tender yet firm to the bite, 5 to 8 minutes. Drain noodles and rinse with cold water. Set aside. | Heat oil in a wok over medium heat. Add pork and stir-fry with a pinch of salt and pepper, about 5 minutes. Transfer meat to a plate, reserving oil in wok. Add carrots, onion, ginger, and garlic to the wok and stir-fry for 3 to 4 minutes. | Add cabbage to the wok and stir-fry briefly, about 1 minute. Add drained soba noodles. Pour in 1/2 the yakisoba sauce and stir-fry until noodles and vegetables are covered with sauce, about 3 minutes. Return pork to the wok. Add additional sauce as desired. Remove from heat. | Garnish yakisoba with kizami nori and a small pile of beni shoga just before serving.",
        "ingredients": "4 (8 ounce) packages buckwheat soba noodles | 2 tablespoons vegetable oil | 1 pound pork tenderloin, cut against the grain in thin strips | 2 cups carrots, cut into julienne strips | 1 medium onion, cut into julienne strips | 1 tablespoon freshly grated ginger | 3 cloves garlic, minced | ½ head napa cabbage, shredded | ⅔ cup yakisoba sauce | salt and ground black pepper to taste | 4 tablespoons pickled red ginger (beni shoga), or to taste | 4 tablespoons kizami nori (dried flaked aonori seaweed), or to taste",
        "url": "https://www.allrecipes.com/recipe/272610/authentic-yakisoba/"
    },
    {
        "name": "Grilled Chicken Teriyaki Skewers with Miso Ranch",
        "summary": "A delicious recipe for teriyaki chicken skewers. If \"teri\" means \"shine,\" and \"yaki\" refers to grilling, then these chicken skewers are the perfect example of teriyaki. Marinated in soy sauce, sake, and mirin, the chicken is grilled to sweet, smoky perfection and dipped in a refreshing, herby miso \"ranch\" sauce that'll send your summer cookout guests into a frenzy. The only bottles not invited to this party are bottled teriyaki sauces! Garnish with sesame seeds if desired.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Soak bamboo skewers in water. | Prepare the chicken skewers: Cut chicken thighs in half lengthwise along the creases and halve the thicker portions to get 3 or 4 pieces each. Place chicken in a bowl. Pour in soy sauce, sake, mirin, brown sugar, green onions, ginger, and oil. Toss by hand until well combined and brown sugar is dissolved. Cover top in plastic wrap and marinate in the refrigerator for 2 to 6 hours. | Make the dressing: Combine mayonnaise, buttermilk, sour cream, and miso in a bowl. Add green onion, garlic, tarragon, dill, and chives. Season with black pepper and cayenne. Whisk dressing until thoroughly combined. | Thread chicken pieces onto skewers. Strain marinade into a saucepan and bring to a boil to make the glaze. | Preheat a grill for medium-high heat. Grill skewers, basting with some of the reserved marinade, until meat firms up and springs back to the touch, 4 to 5 minutes per side. | Serve skewers next to the miso ranch dressing and brush with reserved glaze.\n\n \n\n\n\n\n\n \n Chef John",
        "ingredients": "12 bamboo skewers | 2 pounds skinless, boneless chicken thighs | ½ cup soy sauce | ½ cup sake | ⅓ cup mirin (Japanese sweet wine) | ¼ cup brown sugar | 2 tablespoons minced green onions | 2 teaspoons finely grated ginger | 1 tablespoon vegetable oil | ¾ cup mayonnaise | ⅓ cup buttermilk | ¼ cup sour cream | 1 tablespoon white miso paste, or to taste | 1 tablespoon minced green onion | 1 clove garlic, crushed | 1 tablespoon finely chopped fresh tarragon | 1 tablespoon finely chopped fresh dill | 1 tablespoon finely chopped fresh chives | freshly ground black pepper to taste | 1 pinch cayenne pepper",
        "url": "https://www.allrecipes.com/recipe/273940/grilled-chicken-teriyaki-skewers-with-miso-ranch/"
    },
    {
        "name": "Japanese Broiled Mackerel",
        "summary": "A Japanese marinade sauce gives a lovely taste and texture to broiled mackerel in this Japanese mackerel recipe. Yellowtail, tuna, or salmon are also good in this recipe. Easy and delectable! Serve with a lemon slice or long white radish slice as a garnish.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Rinse fillets; pat dry with paper towels. | Mix together soy sauce, mirin, sugar, and fresh ginger in a medium bowl. Place fillets into marinade and let stand for at least 20 minutes. | Preheat the oven broiler or an outdoor grill for high heat. | Cook fillets in the preheated broiler, basting occasionally, until fish flakes easily with a fork, 5 to 8 minutes.",
        "ingredients": "4  mackerel fillets | ¼ cup soy sauce | ¼ cup mirin (Japanese sweet wine) | 1 tablespoon white sugar | ½ tablespoon grated fresh ginger root",
        "url": "https://www.allrecipes.com/recipe/29497/japanese-broiled-mackerel/"
    },
    {
        "name": "Karaage (Japanese Fried Chicken) with Honey Mayoster Sauce",
        "summary": "This karaage (Japanese fried chicken) with honey mayoster sauce recipe is very easy to make and my guests always enjoy it a lot! It can be served as an appetizer or over a bed of rice as a quick weekday dinner! I usually marinate it the night before to give it more flavor, but if it's a last-minute meal you are preparing, no worries because there's still dipping sauce! Serve it with hot with shredded lettuce and a lemon wedge.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Whisk 1 1/2 tablespoons soy sauce, 1 tablespoon honey, garlic, and ginger together in a large glass or ceramic bowl. Add chicken and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator for 8 hours to overnight. | Remove chicken from marinade and shake off excess. Discard remaining marinade. | Beat egg in a bowl until smooth. Add panko bread crumbs to a shallow bowl. Dip chicken into beaten egg. Lift up so excess egg drips back in the bowl. Press into panko until completely coated. Place the breaded chicken, unstacked, onto a plate. Repeat with remaining chicken. | Heat oil in a deep fryer or large saucepan to 350 degrees F (175 degrees C). Lower chicken carefully into the hot oil in batches. Fry until golden brown, about 5 minutes. Transfer to paper towels to drain. Repeat with remaining chicken. | Whisk Japanese mayonnaise, mirin, 2 tablespoons honey, Dijon mustard, and 1 tablespoon soy sauce together in a bowl; pour sauce over chicken.",
        "ingredients": "1 ½ tablespoons low-sodium soy sauce | 1 tablespoon honey | 2 teaspoons minced garlic | 2 teaspoons minced fresh ginger | 1 pound skinless, boneless chicken thighs, cut into bite-sized pieces | 1  egg | 1 cup panko bread crumbs | vegetable oil for frying | ½ cup Japanese mayonnaise | 3 tablespoons mirin (Japanese sweet wine) | 2 tablespoons honey | 2 tablespoons Dijon mustard | 1 tablespoon low-sodium soy sauce",
        "url": "https://www.allrecipes.com/recipe/258032/karaage-japanese-fried-chicken-with-honey-mayoster-sauce/"
    },
    {
        "name": "Japanese Sweet Omelet",
        "summary": "Tamagoyaki is a delicious, easy, and fun Japanese breakfast! Serve hot with shaved daikon (Japanese radish) and soy sauce.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Mix eggs, water, soy sauce, and sugar in a bowl with a fork until combined. | Heat a skillet over medium heat. Pour egg mixture into skillet and stir with a fork. Cook until omelet begins to set and liquid is no longer visible, 3 to 5 minutes. Fold in half twice.",
        "ingredients": "2  eggs | 1 tablespoon water | 1 teaspoon soy sauce | 1 teaspoon white sugar",
        "url": "https://www.allrecipes.com/recipe/254315/japanese-sweet-omelet/"
    },
    {
        "name": "Chicken Katsu",
        "summary": "Chicken katsu is Japanese-style fried chicken. This is my family recipe and can also be used to make tonkatsu by using pork cutlets instead of chicken. Serve with white rice and tonkatsu sauce.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Season chicken breasts on both sides with salt and pepper. Place flour, beaten egg, and panko crumbs into separate shallow dishes. Coat chicken breasts in flour, shaking off any excess; dip into egg, and then press into panko crumbs until well coated on both sides. | Heat oil in a large skillet over medium-high heat. Place chicken in the hot oil, and fry until golden brown, 3 or 4 minutes per side. Transfer to a paper towel-lined plate to drain.\n\n \n\n\n\n\n\n \n Mitsuha Kirigaija",
        "ingredients": "4 skinless, boneless chicken breast halves - pounded to ½-inch thickness | salt and pepper to taste | 2 tablespoons all-purpose flour | 1  egg, beaten | 1 cup panko bread crumbs | 1 cup oil for frying, or as needed",
        "url": "https://www.allrecipes.com/recipe/72068/chicken-katsu/"
    },
    {
        "name": "Air Fryer Tonkatsu",
        "summary": "This air fryer tonkatsu recipe is crispy on the outside and tender and juicy on the inside. You can buy bottled sauce, but this homemade version is simple to make and far better. Serve over rice if desired.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Make sauce: Whisk together ketchup, soy sauce, brown sugar, sherry, Worcestershire sauce, and garlic in a medium bowl until sugar is dissolved. Set sauce aside. | Preheat an air fryer to 350 degrees F (175 degrees C). | Prepare pork chops: Lay pork chops on a clean work surface; season with salt and pepper. | Beat eggs in a flat dish. Place bread crumbs in a separate flat dish. | Dip a pork chop in beaten eggs, then dredge in bread crumbs. Dip again in eggs, then press in bread crumbs to thoroughly coat. Repeat with remaining pork chops. | Place pork chops in the basket of the preheated air fryer and spray the tops with nonstick cooking spray. Air-fry for 10 minutes. Flip chops over using a spatula and spray the tops with nonstick cooking spray again. Air-fry for 10 more minutes. An instant-read thermometer inserted into the center of pork chops should read 145 degrees F (63 degrees C). | Transfer pork chops to a cutting board and slice. Serve with sauce.",
        "ingredients": "½ cup ketchup | 2 tablespoons soy sauce | 1 tablespoon brown sugar | 1 tablespoon sherry | 2 teaspoons Worcestershire sauce | 1 teaspoon minced garlic | 1 pound boneless pork breakfast chops (4 chops) | salt and ground black pepper to taste | 2 large eggs | 1 ½ cups panko bread crumbs | nonstick cooking spray",
        "url": "https://www.allrecipes.com/recipe/278809/air-fryer-tonkatsu/"
    },
    {
        "name": "Japanese Shrimp Fried Rice with Yum Yum Sauce",
        "summary": "Best shrimp fried rice I've ever made or had! The yum yum sauce tastes better if made the day before, so the flavors can marry.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Bring 3 cups water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and water has been absorbed, 20 to 25 minutes. Set aside and let cool. | Heat 2 tablespoons vegetable oil in a large, deep skillet over medium-high heat. Add onion and cook until soft and translucent, about 5 minutes. Stir in garlic and cook until fragrant, about 1 minute. Mix in cooked jasmine rice and frozen peas and carrots; fry until rice begins to brown, about 5 minutes. Add 2 tablespoons butter and stir to combine. Pour in eggs and cook until firm. Add oyster sauce, soy sauce, and 1/2 lemon juice; stir to combine. Season with salt and pepper. | Heat remaining 1 tablespoon vegetable oil in a separate pan over medium-high heat. Add shrimp and fry until they are bright pink on the outside and the meat is opaque, 2 to 3 minutes. Mix in remaining 2 tablespoons butter and lemon juice. Combine with fried rice mixture. | Combine mayonnaise, water, paprika, ginger paste, white sugar, garlic powder, salt, and pepper in a bowl to make the yum yum sauce. Stir well. Serve with the fried rice.",
        "ingredients": "2 cups uncooked jasmine rice | 3 cups water | 3 tablespoons vegetable oil, divided | 1  sweet onion, chopped | 2 cloves garlic, crushed and minced | 1 (16 ounce) package frozen peas and carrots | 4 tablespoons butter, divided | 2  eggs | 4 tablespoons oyster sauce | 3 tablespoons soy sauce | 1  lemon, juiced, divided | salt and pepper to taste | 1 pound uncooked medium shrimp, peeled and deveined | 1 cup mayonnaise | 3 tablespoons water | 2 tablespoons paprika | 1 teaspoon ginger paste | 1 teaspoon white sugar | ½ teaspoon garlic powder | salt and pepper to taste",
        "url": "https://www.allrecipes.com/recipe/272802/japanese-shrimp-fried-rice-with-yum-yum-sauce/"
    },
    {
        "name": "Miso Braised Pork",
        "summary": "Japanese comfort food! The smell will draw you in!",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Heat canola oil in a large Dutch oven over medium-high heat until hot. Sear pork slices until well browned on both sides, then remove. Stir in the garlic and ginger, cook until fragrant, about 30 seconds. Add the water, soy sauce, brown sugar, and miso; bring to a simmer, scraping the bottom of the pan to dissolve the caramelized juices. | Place pork into pot, add additional water if needed to cover pork with the sauce. Then, reduce heat to medium-low, cover, and simmer for 3 hours until the pork is tender, and the sauce has thickened.",
        "ingredients": "1 tablespoon canola oil | 5 pounds pork butt (shoulder roast) cut into 2-inch slices | 2 tablespoons minced garlic | 1 teaspoon minced ginger | 2 cups water, more if needed | ⅓ cup soy sauce | ⅓ cup brown sugar | ¾ cup white (shiro) miso",
        "url": "https://www.allrecipes.com/recipe/116066/miso-braised-pork/"
    },
    {
        "name": "Miso and Soy Chilean Sea Bass",
        "summary": "This Chilean sea bass recipe marinates the fish in a mirin and miso mixture with brown sugar and soy sauce. It is melt-in-your-mouth delicious! I had it at a restaurant in NYC, and recreated the recipe at home.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Prop the oven door to remain slightly ajar. | Broil sea bass in the preheated oven until fish flakes easily with a fork, 7 to 9 minutes.",
        "ingredients": "⅓ cup sake | ⅓ cup mirin (Japanese sweet rice wine) | ⅓ cup miso paste | ¼ cup packed brown sugar | 3 tablespoons soy sauce | 4 (4 ounce) fillets fresh sea bass, about 1 inch thick | 2 tablespoons chopped green onion",
        "url": "https://www.allrecipes.com/recipe/190094/miso-and-soy-chilean-sea-bass/"
    },
    {
        "name": "Spicy Tuna Sushi Roll",
        "summary": "A great tasting spicy sushi roll, for those who like extra pizzazz. You can use cooked or raw tuna to your preference to achieve great flavors. Great for a filling Japanese meal. Tastes great with a wasabi soy dip.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Bring the rice, water, and vinegar to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Let stand, covered, for about 10 minutes to absorb any excess water. Set rice aside to cool. | Lightly mix together the tuna, mayonnaise, chili powder, and wasabi paste in a bowl, breaking the tuna apart but not mashing it into a paste. | To roll the sushi, cover a bamboo sushi rolling mat with plastic wrap. Lay a sheet of nori, rough side up, on the plastic wrap. With wet fingers, firmly pat a thick, even layer of prepared rice over the nori, covering it completely. Place about 1 tablespoon each of diced cucumber, carrot, and avocado in a line along the bottom edge of the sheet, and spread a line of tuna mixture alongside the vegetables. | Pick up the edge of the bamboo rolling sheet, fold the bottom edge of the sheet up, enclosing the filling, and tightly roll the sushi into a thick cylinder. Once the sushi is rolled, wrap it in the mat and gently squeeze to compact it tightly. Cut each roll into 6 pieces, and refrigerate until served.",
        "ingredients": "2 cups uncooked glutinous white rice | 2 ½ cups water | 1 tablespoon rice vinegar | 1 (5 ounce) can solid white tuna in water, drained | 1 tablespoon mayonnaise | 1 teaspoon chili powder | 1 teaspoon wasabi paste | 4 sheets nori (dry seaweed) | ½  cucumber, finely diced | 1  carrot, finely diced | 1  avocado - peeled, pitted and diced",
        "url": "https://www.allrecipes.com/recipe/190943/spicy-tuna-sushi-roll/"
    },
    {
        "name": "Miso Salmon",
        "summary": "This Japanese-style broiled miso salmon is an easy recipe I came up with at the request of my family. It tastes just like some we've had at Japanese restaurants. Serve with sticky white rice and a light salad.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Preheat the oven to 400 degrees F (200 degrees C). | Fill a large skillet with about 1 inch of water and bring to a boil. Poach fish just until cooked on the outside, about 2 minutes per side. Transfer fillets to a broiler pan. | Stir together miso paste, brown sugar, salad dressing, sake, water, rice vinegar, sesame seeds, and sesame oil in a small bowl. Spread over the tops of the salmon fillets. | Bake in the preheated oven until almost cooked through, about 15 minutes. Switch the oven to broil, and broil until the top is browned and bubbly, about 5 more minutes. Cut fillets into portions to serve.",
        "ingredients": "2 (1 1/2-pound) salmon fillets, skin removed | 1 cup miso paste | ½ cup brown sugar | ½ cup prepared soy-ginger salad dressing | ¼ cup sake | ¼ cup water | 3 tablespoons seasoned rice vinegar | 2 tablespoons sesame seeds | 1 teaspoon sesame oil",
        "url": "https://www.allrecipes.com/recipe/106227/miso-salmon/"
    },
    {
        "name": "Japanese-Style Deep-Fried Shrimp",
        "summary": "These deep-fried shrimp are coated with crispy panko crumbs to make the easiest, tastiest deep-fried shrimp ever!",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": NaN,
        "ingredients": "1 pound medium shrimp, peeled (tails left on) and deveined | ½ teaspoon salt | ½ teaspoon ground black pepper | ½ teaspoon garlic powder | 1 cup all-purpose flour | 1 teaspoon paprika | 2 large eggs, beaten | 1 cup panko crumbs | 1 quart vegetable oil for frying",
        "url": "https://www.allrecipes.com/recipe/127500/japanese-style-deep-fried-shrimp/"
    },
    {
        "name": "Spicy Yellowtail Sushi Roll",
        "summary": "This spicy yellowtail sushi roll recipe topped with flying fish roe is a simple makizushi that has a little kick.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Rinse rice under cold running water until it runs clear. | Bring water and rice to a boil in a large saucepan. Reduce heat to a simmer; simmer for 10 minutes. Turn off heat, let rice sit without opening the lid for 20 minutes; the remaining steam continues to cook the rice. | Stir rice wine vinegar and sugar together in a small bowl until sugar mostly dissolved; stir into rice. Cool rice, 15 to 20 minutes. | Chop yellowtail into 1/4-inch cubes; add to a bowl. Stir in mayonnaise and Sriracha; set aside. Cover a bamboo sushi rolling mat with plastic wrap; set aside. | Lay 1 nori sheet on a work surface, shiny-side down. Place 1/4 rice on nori, spread evenly from edge to edge, about 1/4-inch thick. Flip nori onto the prepared plastic-covered mat. Place 1/4 each yellowtail mixture and cucumber in a line along one short edge. | Roll rice and nori sheet around filling, using the bamboo mat to help. Press roll tightly to form a uniform log. Spread 1/2 tablespoon tobiko in a long thin line across top of roll. Press roll with bamboo mat. Repeat with remaining nori sheets, rice, yellowtail mixture, cucumber, and tobiko. | Cover rolls with plastic wrap; press again with bamboo mat. Slice each roll into 8 pieces using a very sharp, wet, clean knife. Remove plastic wrap before serving.",
        "ingredients": "3 cups water | 2 cups Japanese short-grain white rice | 3 tablespoons rice wine vinegar | 2 ½ tablespoons white sugar | 4 ounces yellowtail flounder | ¼ cup Japanese mayonnaise (such as Kewpie) | 1 tablespoon Sriracha sauce | 4 sheets nori (dry seaweed) | ¼ medium cucumber, peeled and julienned | 2 tablespoons tobiko (flying fish roe)",
        "url": "https://www.allrecipes.com/recipe/283035/spicy-yellowtail-sushi-roll/"
    },
    {
        "name": "Sukiyaki",
        "summary": "Serve this simple Japanese beef sukiyaki stir-fry recipe over thin Japanese noodles or rice, if desired.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Heat oil in a large skillet or wok over medium-high heat. Brown beef in hot oil, then stir in soy sauce, MSG, broth, and sugar. Mix in onion and celery, and cook until tender. Stir in bamboo shoots, green onions, mushrooms, and water chestnuts. Reduce heat to medium, stir in cornstarch, and simmer until sauce is thickened.",
        "ingredients": "1 tablespoon vegetable oil | 1 ½ pounds beef sirloin strips | ⅔ cup soy sauce | 2 teaspoons monosodium glutamate (MSG) | ⅓ cup chicken broth | ⅓ cup white sugar | 3 small onions, sliced | 2 cups chopped celery | 1 (14 ounce) can bamboo shoots, drained and chopped | 4  green onions, sliced | 1 (4.5 ounce) can mushrooms, drained | 1 (8 ounce) can water chestnuts, drained | 1 teaspoon cornstarch",
        "url": "https://www.allrecipes.com/recipe/23053/sukiyaki/"
    },
    {
        "name": "Homemade Sushi Rolls",
        "summary": "This recipe will teach you how to make some popular sushi rolls like California rolls, Philadelphia rolls, or spicy tuna rolls at home.",
        "prep_time": NaN,
        "cook_time": NaN,
        "total_time": NaN,
        "servings": NaN,
        "process": "Put rice into a large deep bowl. Fill with cold water and rub rice together with hands until water turns milky white. Drain cloudy water, being careful not to pour out rice. Repeat three or four times until you can see rice through 3 inches of water; drain once more. | Transfer rice to a saucepan; add kombu and 3 cups water. Let stand 30 minutes. Cover; bring to a boil over high heat. Reduce heat to low; simmer 10 minutes. Remove from heat and let stand, covered, 5 minutes. | Meanwhile, stir together rice vinegar, sugar, and salt in a small bowl until dissolved. | Remove and discard kombu; stir in vinegar mixture until no lumps remain. Spread rice mixture onto a rimmed 9x13 baking sheet. [Spreading helps cool rice and prevents it from continuing to cook.] Let cool to room temperature. | Lay one sheet of nori on a sushi mat lined with plastic wrap; spread 1 cup of rice over nori with damp fingers, leaving a 1-inch border along one edge. Arrange desired fillings (see below) crosswise just off center of rice. Carefully lift filled edge of nori and roll over filling toward unfilled edge, tucking as you roll. Brush unfilled edge of nori with water; press to seal. Cut each roll into 8 pieces. Repeat with remaining nori, rice, and fillings. To make ahead, chill, covered, up to 4 hours.",
        "ingredients": "1 ⅓ cups sushi rice | 1 (4 inch) piece dashi kombu (dried kelp) | 3 cups water | 2 tablespoons rice wine | 2 tablespoons sugar | ¾ teaspoon salt | 4  nori seaweed sheets | desired fillings (see bottom of recipe)",
        "url": "https://www.allrecipes.com/recipe/8536667/homemade-sushi-rolls/"
    }
]