[
    {
        "name": "Homemade Sushi Rolls",
        "ingredients": "1 ⅓ cups sushi rice | 1 (4 inch) piece dashi kombu (dried kelp) | 3 cups water | 2 tablespoons rice wine | 2 tablespoons sugar | ¾ teaspoon salt | 4  nori seaweed sheets | desired fillings (see bottom of recipe)",
        "process": "Put rice into a large deep bowl. Fill with cold water and rub rice together with hands until water turns milky white. Drain cloudy water, being careful not to pour out rice. Repeat three or four times until you can see rice through 3 inches of water; drain once more. | Transfer rice to a saucepan; add kombu and 3 cups water. Let stand 30 minutes. Cover; bring to a boil over high heat. Reduce heat to low; simmer 10 minutes. Remove from heat and let stand, covered, 5 minutes. | Meanwhile, stir together rice vinegar, sugar, and salt in a small bowl until dissolved. | Remove and discard kombu; stir in vinegar mixture until no lumps remain. Spread rice mixture onto a rimmed 9x13 baking sheet. [Spreading helps cool rice and prevents it from continuing to cook.] Let cool to room temperature. | Lay one sheet of nori on a sushi mat lined with plastic wrap; spread 1 cup of rice over nori with damp fingers, leaving a 1-inch border along one edge. Arrange desired fillings (see below) crosswise just off center of rice. Carefully lift filled edge of nori and roll over filling toward unfilled edge, tucking as you roll. Brush unfilled edge of nori with water; press to seal. Cut each roll into 8 pieces. Repeat with remaining nori, rice, and fillings. To make ahead, chill, covered, up to 4 hours.",
        "url": "https://www.allrecipes.com/recipe/8536667/homemade-sushi-rolls/"
    },
    {
        "name": "Homemade Sushi",
        "ingredients": "1 ⅓ cups water | ⅔ cup uncooked short-grain white rice | 3 tablespoons rice vinegar | 3 tablespoons white sugar | 1 ½ teaspoons salt | 4 sheets nori seaweed sheets | ½ pound imitation crabmeat, flaked | 1  avocado - peeled, pitted, and sliced | ½  cucumber, peeled, cut into small strips | 2 tablespoons pickled ginger",
        "process": "Bring water to a boil in a medium pot; stir in rice. Reduce heat to medium-low, cover, and simmer until rice is tender and water has been absorbed, 20 to 25 minutes. | Heat nori in the preheated oven until warm, 1 to 2 minutes.",
        "url": "https://www.allrecipes.com/recipe/24228/sushi-roll/"
    },
    {
        "name": "Oyakodon (Japanese Chicken and Egg Rice Bowl)",
        "ingredients": "1 tablespoon olive oil | 4  skinless, boneless chicken thighs, cut into small pieces | 1  onion, cut in half and sliced | 2 cups dashi stock, made with dashi powder | ¼ cup soy sauce | 3 tablespoons mirin (Japanese rice wine) | 3 tablespoons brown sugar | 4 large eggs | 4 cups hot cooked white rice",
        "process": "Heat oil in a large skillet over medium heat. Add chicken and cook until beginning to brown, about 5 minutes. Add onion; cook and stir until onion is translucent, about 5 minutes. | Pour in stock, then whisk in soy sauce, mirin, and brown sugar; stir until sugar dissolves. Bring to a boil, then lower heat and simmer until slightly reduced, about 10 minutes. | Whisk eggs in a bowl until well-beaten, then pour into the hot stock mixture. Cover the skillet, reduce the heat, and steam until egg is cooked, about 5 minutes. Remove from the heat. | Divide rice among 4 deep soup bowls and top with equal amounts of the soup mixture.",
        "url": "https://www.allrecipes.com/recipe/128589/oyakodon-japanese-chicken-and-egg-rice-bowl/"
    },
    {
        "name": "Miso Braised Pork",
        "ingredients": "1 tablespoon canola oil | 5 pounds pork butt (shoulder roast) cut into 2-inch slices | 2 tablespoons minced garlic | 1 teaspoon minced ginger | 2 cups water, more if needed | ⅓ cup soy sauce | ⅓ cup brown sugar | ¾ cup white (shiro) miso",
        "process": "Heat canola oil in a large Dutch oven over medium-high heat until hot. Sear pork slices until well browned on both sides, then remove. Stir in the garlic and ginger, cook until fragrant, about 30 seconds. Add the water, soy sauce, brown sugar, and miso; bring to a simmer, scraping the bottom of the pan to dissolve the caramelized juices. | Place pork into pot, add additional water if needed to cover pork with the sauce. Then, reduce heat to medium-low, cover, and simmer for 3 hours until the pork is tender, and the sauce has thickened.",
        "url": "https://www.allrecipes.com/recipe/116066/miso-braised-pork/"
    },
    {
        "name": "Sukiyaki",
        "ingredients": "1 tablespoon vegetable oil | 1 ½ pounds beef sirloin strips | ⅔ cup soy sauce | 2 teaspoons monosodium glutamate (MSG) | ⅓ cup chicken broth | ⅓ cup white sugar | 3 small onions, sliced | 2 cups chopped celery | 1 (14 ounce) can bamboo shoots, drained and chopped | 4  green onions, sliced | 1 (4.5 ounce) can mushrooms, drained | 1 (8 ounce) can water chestnuts, drained | 1 teaspoon cornstarch",
        "process": "Heat oil in a large skillet or wok over medium-high heat. Brown beef in hot oil, then stir in soy sauce, MSG, broth, and sugar. Mix in onion and celery, and cook until tender. Stir in bamboo shoots, green onions, mushrooms, and water chestnuts. Reduce heat to medium, stir in cornstarch, and simmer until sauce is thickened.",
        "url": "https://www.allrecipes.com/recipe/23053/sukiyaki/"
    },
    {
        "name": "Sesame-Seared Tuna",
        "ingredients": "¼ cup soy sauce | 2 tablespoons sesame oil | 1 tablespoon mirin (Japanese sweet wine) | 1 tablespoon honey | 1 tablespoon rice wine vinegar | ½ cup sesame seeds | 4 (6 ounce) tuna steaks | 1 tablespoon olive oil | wasabi paste",
        "process": NaN,
        "url": "https://www.allrecipes.com/recipe/71698/sesame-seared-tuna/"
    },
    {
        "name": "Karaage (Japanese Fried Chicken)",
        "ingredients": "1 clove garlic, finely grated | 1 tablespoon finely grated fresh ginger | 3 tablespoons soy sauce | 3 tablespoons sake | 1 tablespoon mirin | ⅛ teaspoon sesame oil | ¼ teaspoon ground black pepper | 1 pinch cayenne pepper | ½ teaspoon white sugar | ¼ teaspoon kosher salt | 1 ¼ pounds boneless, skinless chicken thighs, cut into 2-inch pieces | 1 cup potato starch | 1 quart canola oil, or as needed",
        "process": "Mix garlic, ginger, soy sauce, sake, mirin, sesame oil, black pepper, cayenne, sugar, and salt in a medium bowl. | Place chicken in the marinade and mix until thoroughly and evenly coated. Cover and refrigerate for 1 to 10 hours. | Set up your dredging station: Place a wire rack over a foil-lined baking sheet. Add potato starch to a wide, shallow bowl. | Remove chicken from the refrigerator. Stir to coat with marinade. Toss 2 or 3 pieces at a time in the potato starch until evenly coated. Shake off any excess starch and place chicken on the wire rack. Repeat to dredge remaining pieces. | Tap the rack on the baking sheet to remove any loose chunks of starch, then transfer the baking sheet and rack of chicken to the refrigerator for 15 to 30 minutes. | Heat oil in a deep fryer to 350 degrees F (175 degrees C). | Without crowding, lower chicken carefully into the hot oil in batches. Fry, tossing occasionally, until cooked through and the outside is crunchy and browned, 3 to 4 minutes. Transfer to a paper towel-lined plate to drain. Repeat with remaining chicken.\n\n \n\n\n\n\n\n \n Karaage Japanese Fried Chicken.\nChef John",
        "url": "https://www.allrecipes.com/recipe/8325387/karaage-japanese-fried-chicken/"
    },
    {
        "name": "Spicy Tuna Sushi Roll",
        "ingredients": "2 cups uncooked glutinous white rice | 2 ½ cups water | 1 tablespoon rice vinegar | 1 (5 ounce) can solid white tuna in water, drained | 1 tablespoon mayonnaise | 1 teaspoon chili powder | 1 teaspoon wasabi paste | 4 sheets nori (dry seaweed) | ½  cucumber, finely diced | 1  carrot, finely diced | 1  avocado - peeled, pitted and diced",
        "process": "Bring the rice, water, and vinegar to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Let stand, covered, for about 10 minutes to absorb any excess water. Set rice aside to cool. | Lightly mix together the tuna, mayonnaise, chili powder, and wasabi paste in a bowl, breaking the tuna apart but not mashing it into a paste. | To roll the sushi, cover a bamboo sushi rolling mat with plastic wrap. Lay a sheet of nori, rough side up, on the plastic wrap. With wet fingers, firmly pat a thick, even layer of prepared rice over the nori, covering it completely. Place about 1 tablespoon each of diced cucumber, carrot, and avocado in a line along the bottom edge of the sheet, and spread a line of tuna mixture alongside the vegetables. | Pick up the edge of the bamboo rolling sheet, fold the bottom edge of the sheet up, enclosing the filling, and tightly roll the sushi into a thick cylinder. Once the sushi is rolled, wrap it in the mat and gently squeeze to compact it tightly. Cut each roll into 6 pieces, and refrigerate until served.",
        "url": "https://www.allrecipes.com/recipe/190943/spicy-tuna-sushi-roll/"
    },
    {
        "name": "Beef Teppanyaki",
        "ingredients": "3 tablespoons soy sauce | 2 tablespoons sweet cooking wine (mirin) | 1 teaspoon garlic powder | 1 teaspoon ground black pepper | ½ teaspoon ground ginger | 1 pound beef chunks, very thinly sliced | 3 tablespoons vegetable oil | 1 tablespoon sweet cooking wine (mirin)",
        "process": "Combine soy sauce, mirin, garlic powder, black pepper, and ground ginger together in a bowl. Add sliced beef and mix well. Leave to marinate at least 1 hour. | Heat oil in a frying pan over medium-high heat. Fry beef slices, about 10 minutes, and place on a serving dish. | Pour leftover marinade into the same frying pan over low heat. Add mirin and simmer until sauce is slightly thickened, 1 to 2 minutes. Pour sauce over beef and serve.",
        "url": "https://www.allrecipes.com/recipe/265980/beef-teppanyaki/"
    },
    {
        "name": "Chicken Karaage (Japanese Fried Chicken)",
        "ingredients": "2 tablespoons soy sauce | 1 tablespoon sake (Japanese rice wine) | 2 teaspoons grated fresh ginger | 1 ½ pounds boneless, skinless chicken breasts, cut into bite-size pieces | 2 cups vegetable oil for frying | ¾ cup cornstarch",
        "process": "Combine soy sauce, sake, and ginger in a large bowl. Add chicken; turn to coat. Cover with plastic wrap and marinate in the refrigerator for 30 minutes. | Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). | Place cornstarch in a large resealable plastic bag. Add chicken; seal bag and toss until chicken is coated with cornstarch. | Fry chicken in batches until golden brown and juices run clear, 2 to 3 minutes. Drain on paper towels or on a wire rack.",
        "url": "https://www.allrecipes.com/recipe/246854/chicken-karaage-japanese-fried-chicken/"
    },
    {
        "name": "Grilled Chicken Teriyaki Skewers with Miso Ranch",
        "ingredients": "12 bamboo skewers | 2 pounds skinless, boneless chicken thighs | ½ cup soy sauce | ½ cup sake | ⅓ cup mirin (Japanese sweet wine) | ¼ cup brown sugar | 2 tablespoons minced green onions | 2 teaspoons finely grated ginger | 1 tablespoon vegetable oil | ¾ cup mayonnaise | ⅓ cup buttermilk | ¼ cup sour cream | 1 tablespoon white miso paste, or to taste | 1 tablespoon minced green onion | 1 clove garlic, crushed | 1 tablespoon finely chopped fresh tarragon | 1 tablespoon finely chopped fresh dill | 1 tablespoon finely chopped fresh chives | freshly ground black pepper to taste | 1 pinch cayenne pepper",
        "process": "Soak bamboo skewers in water. | Prepare the chicken skewers: Cut chicken thighs in half lengthwise along the creases and halve the thicker portions to get 3 or 4 pieces each. Place chicken in a bowl. Pour in soy sauce, sake, mirin, brown sugar, green onions, ginger, and oil. Toss by hand until well combined and brown sugar is dissolved. Cover top in plastic wrap and marinate in the refrigerator for 2 to 6 hours. | Make the dressing: Combine mayonnaise, buttermilk, sour cream, and miso in a bowl. Add green onion, garlic, tarragon, dill, and chives. Season with black pepper and cayenne. Whisk dressing until thoroughly combined. | Thread chicken pieces onto skewers. Strain marinade into a saucepan and bring to a boil to make the glaze. | Preheat a grill for medium-high heat. Grill skewers, basting with some of the reserved marinade, until meat firms up and springs back to the touch, 4 to 5 minutes per side. | Serve skewers next to the miso ranch dressing and brush with reserved glaze.\n\n \n\n\n\n\n\n \n Chef John",
        "url": "https://www.allrecipes.com/recipe/273940/grilled-chicken-teriyaki-skewers-with-miso-ranch/"
    },
    {
        "name": "Tonkatsu",
        "ingredients": "4 (4 ounce) boneless pork chops | salt and ground black pepper to taste | 2 cups oil for frying, or as needed | ¼ cup all-purpose flour | 1  egg, beaten | ¾ cup panko (Japanese-style) bread crumbs",
        "process": "Place pork chops between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound pork with the smooth side of a meat mallet to a 1/4-inch thickness (about .75 cm). Season with salt and black pepper. | Pour oil into a skillet until 1/2 inch (1.25 cm) deep; heat over medium-high heat to 375 degrees F (190 degrees C). | Place flour, egg, and panko bread crumbs into 3 separate bowls. Dredge pork cutlets in flour; shake off excess. Dip into beaten egg. Lift up so excess egg drips back into the bowl. Press into bread crumbs to coat both sides; tap off any loose crumbs. Place breaded cutlets, unstacked, onto a plate. | Lower cutlets carefully into the hot oil. Fry until golden brown and cooked through, about 4 minutes per side. Transfer to a paper-towel-lined plated to drain.",
        "url": "https://www.allrecipes.com/recipe/46543/tonkatsu/"
    },
    {
        "name": "Japanese Curry Chicken",
        "ingredients": "1 ½ pounds skinless, boneless chicken breast, or more to taste | 1 tablespoon olive oil, or as needed | salt and ground black pepper to taste | 5 ⅓ cups water, divided | 1 (7.75 ounce) package curry sauce mix (such as S&B Golden Curry) | 1 (15 ounce) can peas, drained | 5  new potatoes, halved | 1 (8 ounce) package sliced cremini mushrooms | 2 medium carrots, chopped | 1 medium onion, chopped | 2 cups jasmine rice (such as Mahatma)",
        "process": "Place chicken in a large, deep skillet. Drizzle with olive oil and season with salt and pepper on both sides. Add 1/3 cup water to the skillet, cover, and cook over medium heat until no longer pink in the center and the juices run clear, about 20 minutes. | While chicken is cooking, pour 2 cups water into a microwave-safe bowl. Break curry sauce mix into pieces and add to water. Heat in the microwave on high for 3 minutes and 30 seconds; remove and stir until sauce mix is completely dissolved. | Remove chicken from the skillet. Cut into cubes, return to the skillet, and pour curry sauce over top. Stir in peas, potatoes, mushrooms, carrots, and onion. Bring to a boil, then reduce heat and simmer until vegetables are tender, about 30 minutes. | Meanwhile, bring remaining 3 cups water and rice to a boil in a medium saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and water has been absorbed, 20 to 25 minutes. | Scoop rice into bowls and serve curry chicken on top.",
        "url": "https://www.allrecipes.com/recipe/277861/japanese-curry-chicken/"
    },
    {
        "name": "Miso Salmon",
        "ingredients": "2 (1 1/2-pound) salmon fillets, skin removed | 1 cup miso paste | ½ cup brown sugar | ½ cup prepared soy-ginger salad dressing | ¼ cup sake | ¼ cup water | 3 tablespoons seasoned rice vinegar | 2 tablespoons sesame seeds | 1 teaspoon sesame oil",
        "process": "Preheat the oven to 400 degrees F (200 degrees C). | Fill a large skillet with about 1 inch of water and bring to a boil. Poach fish just until cooked on the outside, about 2 minutes per side. Transfer fillets to a broiler pan. | Stir together miso paste, brown sugar, salad dressing, sake, water, rice vinegar, sesame seeds, and sesame oil in a small bowl. Spread over the tops of the salmon fillets. | Bake in the preheated oven until almost cooked through, about 15 minutes. Switch the oven to broil, and broil until the top is browned and bubbly, about 5 more minutes. Cut fillets into portions to serve.",
        "url": "https://www.allrecipes.com/recipe/106227/miso-salmon/"
    },
    {
        "name": "Teriyaki Rib Eye Steaks",
        "ingredients": "2 tablespoons soy sauce | 2 tablespoons water | 1 tablespoon white sugar | 1 ½ teaspoons honey | 1 ½ teaspoons Worcestershire sauce | 1 ¼ teaspoons distilled white vinegar | 1 teaspoon olive oil | ¼ teaspoon onion powder | ¼ teaspoon garlic powder | ⅛ teaspoon ground ginger | 2 (6 ounce) lean beef rib eye steaks",
        "process": "Whisk soy sauce, water, sugar, honey, Worcestershire sauce, vinegar, olive oil, onion powder, garlic powder, and ground ginger together in a large glass or ceramic bowl. Pierce steaks several times with a fork. Add steaks to bowl; toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator at least 2 hours. | Cook steaks in a hot skillet, wok, or hibachi over medium heat, 7 minutes per side for medium. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).",
        "url": "https://www.allrecipes.com/recipe/107586/teriyaki-rib-eye-steaks/"
    },
    {
        "name": "Steamed Clams in Butter and Sake",
        "ingredients": "1 ¼ pounds clams in shell, scrubbed | 4 teaspoons sake | 4 teaspoons mirin (Japanese sweet wine) | 2 teaspoons rice wine vinegar | 3 tablespoons unsalted butter | 1  green onion, chopped | 1 teaspoon soy sauce",
        "process": "Scrub and rinse clams. Soak in a large bowl of cold water for 5 minutes. Drain thoroughly. | Heat a wok or large saucepan over high heat. Quickly add sake, mirin and rice wine vinegar. Add clams; cover and cook until clams open, 3 to 4 minutes. Discard any that do not open. | Remove any scum that forms on the surface using a spoon or paper towel. Stir in butter, green onion, and soy sauce, tossing to coat clams as butter melts. Arrange clams on a serving plate; drizzle sauce over top. Serve immediately.",
        "url": "https://www.allrecipes.com/recipe/157438/steamed-clams-in-butter-and-sake/"
    },
    {
        "name": "Yakisoba Chicken",
        "ingredients": "½ teaspoon sesame oil | 1 tablespoon canola oil | 2 tablespoons chile paste | 2 cloves garlic, chopped | 4  skinless, boneless chicken breast halves - cut into 1 inch cubes | ½ cup soy sauce | 1  onion, sliced lengthwise into eighths | ½ medium head cabbage, coarsely chopped | 2  carrots, coarsely chopped | 8 ounces soba noodles, cooked and drained",
        "process": "In a large skillet combine sesame oil, canola oil and chili paste; stir-fry 30 seconds. Add garlic and stir fry an additional 30 seconds. Add chicken and 1/4 cup of the soy sauce and stir fry until chicken is no longer pink, about 5 minutes. Remove mixture from pan, set aside, and keep warm. | In the emptied pan combine the onion, cabbage, and carrots. Stir-fry until cabbage begins to wilt, 2 to 3 minutes. Stir in the remaining soy sauce, cooked noodles, and the chicken mixture to pan and mix to blend. Serve and enjoy!",
        "url": "https://www.allrecipes.com/recipe/8628/yakisoba-chicken/"
    },
    {
        "name": "Okonomiyaki (Japanese Pancake)",
        "ingredients": "1 cup all-purpose flour | ⅔ cup water | 4 cups chopped cabbage | 6 strips cooked bacon, crumbled | 2  eggs | 1  sausage, diced, or more to taste (Optional) | ½ cup chopped green onions | ¼ cup cooked shrimp (Optional) | ¼ cup shredded cheese (Optional) | ¼ cup tenkasu (tempura pearls) | 1 tablespoon vegetable oil, or to taste | 2 tablespoons soy sauce | 1 tablespoon ketchup | 1 teaspoon white vinegar | 1 tablespoon panko bread crumbs, or to taste | 1 teaspoon mayonnaise, or to taste",
        "process": "Mix flour and water together in a bowl until smooth. Stir in cabbage, bacon, eggs, sausage, green onions, shrimp, cheese, and tenkasu. | Preheat a griddle to 400 degrees F (200 degrees C) and coat with oil. | Pour 1/4 of batter onto preheated griddle. Cook until golden brown, about 6 minutes per side. Transfer to a serving plate. Repeat to make a total of 4 pancakes. | Make sauce: Mix soy sauce, ketchup, and vinegar together in a small bowl. Drizzle over pancakes. | Garnish with panko and mayonnaise.",
        "url": "https://www.allrecipes.com/recipe/255416/okonomiyaki-japanese-pancake/"
    },
    {
        "name": "Steamed Egg (Chawan Mushi)",
        "ingredients": "2  eggs | 1 cup cooled chicken or fish stock | 1 dash sake | ½ teaspoon soy sauce | ½ cup chopped cooked chicken breast meat | 1  shiitake mushroom, sliced into strips | 2 sprigs fresh parsley, for garnish",
        "process": "In a medium bowl, whisk eggs gently while slowly pouring in the chicken stock, sake, and soy sauce. Divide the mushroom and chicken evenly between two small tea cups. Pour the egg mixture into each cup until filled. | Bring about 1 inch of water to a boil in a steamer or saucepan. Reduce heat to a simmer, and place cups into the steamer. Cover, and steam for 12 minutes, or until egg is firm but soft and silky like tofu. Garnish each cup with a sprig of parsley, and serve.",
        "url": "https://www.allrecipes.com/recipe/72231/steamed-egg-chawan-mushi/"
    },
    {
        "name": "Japanese-Style Deep-Fried Shrimp",
        "ingredients": "1 pound medium shrimp, peeled (tails left on) and deveined | ½ teaspoon salt | ½ teaspoon ground black pepper | ½ teaspoon garlic powder | 1 cup all-purpose flour | 1 teaspoon paprika | 2 large eggs, beaten | 1 cup panko crumbs | 1 quart vegetable oil for frying",
        "process": NaN,
        "url": "https://www.allrecipes.com/recipe/127500/japanese-style-deep-fried-shrimp/"
    }
]